app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      @artist = Artist.find_by(id:params[:artist_id])
      @song = @artist.songs.find_by(id:params[:id])
      # if @artist.nil?
      #   redirect_to artists_path, alert: "Artist not found"
      if @song.nil?
        redirect_to artist_songs_path, alert: "Song not found"
      end

    else
      @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]
SELECT  "songs".* FROM "songs" WHERE (1) LIMIT 1